#include  "Landzo_Electromagnetism.h"


/*************************************************************************
*                           蓝宙电子工作室
*
*  函数名称：Electromagnetism_init
*  功能说明：电磁传感器初始化程序
*  参数说明：
*  函数返回：无
*  修改时间：2014-9-12
*  备    注：
*************************************************************************/
void Electromagnetism_init(void)
{
  adc_init(ADC0_SE12); //传感器AD初始化 PTB2
  adc_init(ADC0_SE13); //传感器AD初始化  PTB3
}

/*************************************************************************
*                           蓝宙电子工作室
*
*  函数名称：Electromagnetism_init
*  功能说明：电磁传感器初始化程序
*  参数说明： *leftad  返回ad采样值
*             *rightad  
*  函数返回：
*  修改时间：2014-9-12
*  备    注：
*************************************************************************/
void Electromagnetism_AD(uint8_t *leftad , uint8_t *rightad)
{
  *leftad  = ad_ave(ADC0_SE12, ADC_8bit, 5);   //左传感器采集信号采集5次均值滤波
  *rightad = ad_ave(ADC0_SE13, ADC_8bit, 5);   //右传感器采集信号采集5次均值滤波
}